#2) for ციკლისა და range ის მეშვეობით გამოიტანეთ ერთიდან ათამდე ლუწი რიცხვები
for i in range(0,10,2): 
    print(i)
#3) while ციკლის მეშვეობით გამოიტანეთ ერთიდან ოცამდე ციფრები
i = 0
while i<20:
    print(i)
    i=i + 1
#4) while ციკლის მეშვეობით ნულიდან ხუთის ჩათვლით შეკრიბეთ ციფრები.
i = 1
sum = 0 
while i<=5:
    i=i+1
    sum=sum + i
print("numbers sum is ", +sum)
# 5) for ციკლში გამოიყენეთ რაიმე string და გატესტეთ როგორ მუშაობს იგი (გამოიტანეთ სტრინგის თითო სიმბოლო ყოველ იტერაციაზე.
for i in input("Write a word: "):
    print(i)